eisup_2019_docmng_integration/src/DataProcessors/абс_АнализДоходовРасходов/абс_АнализДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_АнализДоходовРасходов</name>
  <attributes>
    <name>РасходныйДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Кейс</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Регистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Регистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/AccumulationRegisters/ОборотыБюджетов/ОборотыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыБюджетов</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_СчетБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_Город</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ДДСПоПроектам/абс_ДДСПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ДДСПоПроектам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФактОперФакт</name>
    <type>
      <types>EnumRef.абс_ФактОперФакт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОплатаАванс</name>
    <type>
      <types>EnumRef.ВидыОтчетовПоПлатежамКомиссия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <comment>Незакрытый документ поставки/оплаты</comment>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</types>
      <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ФактОперФакт/абс_ФактОперФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ФактОперФакт</name>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>ОперФакт</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыОтчетовПоПлатежамКомиссия/ВидыОтчетовПоПлатежамКомиссия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтчетовПоПлатежамКомиссия</name>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАванса</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/DataProcessors/абс_АнализДоходовРасходов/ObjectModule.bsl
Функция ПолучитьТаблицуРасходов(Кейсы) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыБюджетовОбороты.ДоговорКонтрагента КАК Договор,
	|	ОборотыБюджетовОбороты.Проект,
	|	ОборотыБюджетовОбороты.Регистратор,
	|	ОборотыБюджетовОбороты.СуммаУпрОборот КАК Сумма,
	|	0 КАК СуммаОплаты
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|				И Сценарий В (&СценарииФакт)
	|				И Проект В ИЕРАРХИИ (&Кейсы)) КАК ОборотыБюджетовОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ДДСПоПроектамОбороты.ДоговорКонтрагента,
	|	абс_ДДСПоПроектамОбороты.Проект,
	|	абс_ДДСПоПроектамОбороты.Регистратор,
	|	0,
	|	абс_ДДСПоПроектамОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.абс_ДДСПоПроектам.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|				И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				И ФактОперФакт = ЗНАЧЕНИЕ(Перечисление.абс_ФактОперФакт.Факт)
	|				И ОплатаАванс В (ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Оплата), ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Аванс))
	|				И Проект В ИЕРАРХИИ (&Кейсы)) КАК абс_ДДСПоПроектамОбороты";
	
	Запрос.УстановитьПараметр("РасходныйДоговор", РасходныйДоговор);
	СписокСценариевФакт = Новый СписокЗначений;
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000003"));  //Факт
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000055"));  //ТД по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000028"));  //КВ по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000059"));  //Поступление ТМЦ
	Запрос.УстановитьПараметр("СценарииФакт", СписокСценариевФакт);
	Запрос.УстановитьПараметр("Кейсы", Кейсы);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции

Функция ПолучитьТаблицуДоходов(Кейсы) Экспорт 
	Запрос = Новый Запрос;
	Запрос .Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыБюджетовОбороты.ДоговорКонтрагента КАК Договор,
	|	ОборотыБюджетовОбороты.Проект,
	|	ОборотыБюджетовОбороты.Регистратор,
	|	ОборотыБюджетовОбороты.СуммаУпрОборот КАК Сумма,
	|	0 КАК СуммаОплаты
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &ДоходныйДоговор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДоговорКонтрагента = &ДоходныйДоговор
	|				КОНЕЦ
	|				И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|				И Проект В ИЕРАРХИИ (&ПроектКейс)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	ОборотыБюджетовОбороты.ДоговорКонтрагента.абс_СтатусДоговора  в (&Исполнение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ДДСПоПроектамОбороты.ДоговорКонтрагента,
	|	абс_ДДСПоПроектамОбороты.Проект,
	|	абс_ДДСПоПроектамОбороты.Регистратор,
	|	0,
	|	абс_ДДСПоПроектамОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.абс_ДДСПоПроектам.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &ДоходныйДоговор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДоговорКонтрагента = &ДоходныйДоговор
	|				КОНЕЦ
	|				И ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				И ФактОперФакт = ЗНАЧЕНИЕ(Перечисление.абс_ФактОперФакт.Факт)
	|				И ОплатаАванс В (ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Оплата), ЗНАЧЕНИЕ(Перечисление.ВидыОтчетовПоПлатежамКомиссия.Аванс))
	|				И Проект В ИЕРАРХИИ (&ПроектКейс)) КАК абс_ДДСПоПроектамОбороты";
	
	//родин лимиты по договорам			   
	МассивИсполнение = Новый Массив;			   
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.Корректировка);
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.СогласованиеОФКПослеКоррректировки);
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.ОтказПослеКорректировки);
	МассивИсполнение.Добавить(Перечисления.абсСтатусыДоговоров.Исполнение);
	Запрос.УстановитьПараметр("Исполнение",МассивИсполнение);
	//родин лимиты по договорам	
	
	Запрос.УстановитьПараметр("ПроектКейс", Кейсы);
	СписокСценариевФакт = Новый СписокЗначений;
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000003"));  //Факт
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000055"));  //ТД по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000028"));  //КВ по поставке ФАКТ
	СписокСценариевФакт.Добавить(Справочники.СценарииПланирования.НайтиПоКоду("000000059"));  //Поступление ТМЦ
	Запрос.УстановитьПараметр("СценарииФакт", СписокСценариевФакт);
	Запрос.УстановитьПараметр("ДоходныйДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции

Функция ПолучитьМассивКейсПроектов(ДоговорКонтрагента) Экспорт 
		
	Если Проекты.Количество() > 0 Тогда 
		ТаблицаПроектов = Проекты.Выгрузить();
	Иначе 
		ТаблицаПроектов = ДоговорКонтрагента.абс_Проекты.Выгрузить(, "Проект");
	КонецЕсли;
	
	ТаблицаПроектов.Свернуть("Проект");
	
	Результат = ТаблицаПроектов.СкопироватьКолонки();
	
	Для каждого СтрокаТЗ Из ТаблицаПроектов Цикл
		КейсПроект = ОпределитьКейсПроект(СтрокаТЗ.Проект);
		Если Не КейсПроект = Неопределено Тогда
			СтрРез = Результат.Добавить();
			СтрРез.Проект = КейсПроект;
		КонецЕСли;
	КонецЦикла;
	
	Результат.Свернуть("Проект");
	МассивКейсПроектов = Результат.ВыгрузитьКолонку("Проект");
	Если МассивКейсПроектов.Количество() > 0 Тогда 
		Кейс = МассивКейсПроектов[0];
	Иначе 
		Кейс = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
	
	
	Возврат Результат.ВыгрузитьКолонку("Проект");
	
КонецФункции

Функция ОпределитьКейсПроект(ТекПроект) 
			
	Если ТекПроект.абс_Case Тогда
		КейсПроект = ТекПроект;
	Иначе
		Если ЗначениеЗаполнено(ТекПроект.Родитель) Тогда
			КейсПроект = ОпределитьКейсПроект(ТекПроект.Родитель);
		Иначе
			КейсПроект = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат КейсПроект;
	
КонецФункции

Процедура ЗаполнитьТаблицы() Экспорт 
	Кейсы = ПолучитьМассивКейсПроектов(РасходныйДоговор);
	РасходыПоПроектам = ПолучитьТаблицуРасходов(Кейсы);
	ДоходыПоПроектам = ПолучитьТаблицуДоходов(Кейсы);
	Расходы.Загрузить(РасходыПоПроектам);
	Доходы.Загрузить(ДоходыПоПроектам);
КонецПроцедуры
